Revit 2027 API
BuiltInFailures.SketchFailures.WrongCutBoundaryLoops Property
 Only open loops can be used for Edit Cut Profile. All open ends must lie on the boundary of the cut profile, and the loop may not touch the boundary anywhere except at its ends.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId WrongCutBoundaryLoops { get; }
Public Shared ReadOnly Property WrongCutBoundaryLoops As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ WrongCutBoundaryLoops {
	FailureDefinitionId^ get ();
}
static member WrongCutBoundaryLoops : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace